{
    "personagens":[
        {
            "id": 1,
            "nome": "Harry Potter",
            "casa": "Grifinória",
            "descricao": "Harry Potter é um jovem bruxo órfão que descobre, aos 11 anos, que é famoso no mundo mágico por ter sobrevivido a um ataque do vilão Lord Voldemort quando era apenas um bebê. Ele frequenta a Escola de Magia e Bruxaria de Hogwarts, onde faz amizades, enfrenta desafios e descobre seu papel crucial na luta contra as forças das trevas. Ao longo da série, Harry desenvolve suas habilidades mágicas, aprende sobre amizade e coragem.",
            "imagem": "imagens/Personagens/harryPotter.png"
        },

        {
            "id": 2,
            "nome": "Hermione Granger",
            "casa": "Grifinória",
            "descricao": "Hermione Granger é uma brilhante bruxa nascida trouxa, conhecida por sua inteligência e dedicação aos estudos. Ela torna-se amiga próxima de Harry Potter e Ron Weasley ao entrar na Escola de Magia e Bruxaria de Hogwarts. Hermione destaca-se por sua ética de trabalho, conhecimento enciclopédico e defesa dos direitos dos elfos domésticos. Ela desafia estereótipos, prova ser uma bruxa excepcional e desempenha um papel vital na luta contra as forças das trevas. Ao longo da série, Hermione demonstra coragem, lealdade e uma busca constante pelo conhecimento.",
            "imagem": "imagens/Personagens/hermione.png"
        },

        {
            "id": 3,
            "nome": "Ron Weasley",
            "casa": "Grifinória",
            "descricao": "Ron Weasley é um bruxo nascido em uma família grande e amorosa, conhecido por sua lealdade e senso de humor. Ele torna-se amigo de Harry Potter e Hermione Granger em Hogwarts. Ron, muitas vezes, lida com o fardo de ser o sexto filho em uma família numerosa e financeiramente modesta. Apesar disso, ele mostra coragem em situações desafiadoras e é peça fundamental nas aventuras de Harry. Ao longo da série, Ron enfrenta seus medos, fortalece suas amizades e desempenha um papel vital na luta contra as forças das trevas.",
            "imagem": "imagens/Personagens/ron.png"
        },

        {
            "id": 4,
            "nome": "Luna Lovegoog",
            "casa": "Cornival",
            "descricao": "Luna Lovegood é uma bruxa singular e excêntrica, reconhecida por sua natureza sonhadora e visão única do mundo mágico. Ela se tornou uma amiga leal de Harry Potter, mostrando uma sensibilidade especial para o extraordinário. Luna se destaca por sua mente aberta, crença na magia e sua coragem inabalável em defender suas convicções, trazendo uma perspectiva singular para o grupo de amigos durante a batalha contra as forças das trevas.",
            "imagem": "imagens/Personagens/luna.png"
        },

        {
            "id": 5,
            "nome": "Draco Malfoy",
            "casa": "Sonserina",
            "descricao": "Draco Malfoy é um bruxo de linhagem nobre, conhecido por sua arrogância e determinação em Hogwarts. Ele faz parte de um círculo de amigos mais exclusivo, mantendo uma postura desafiadora em relação a Harry Potter e seus amigos. Draco se destaca por seu orgulho, astúcia e lealdade à sua família, enfrentando conflitos internos entre suas convicções e as expectativas impostas sobre ele. Ao longo da saga, ele enfrenta dilemas morais e demonstra a complexidade das escolhas entre o bem e o mal.",
            "imagem": "imagens/Personagens/dracoMalfoy.png"
        },

        {
            "id": 6,
            "nome": "Cho Chang",
            "casa": "Cornival",
            "descricao": "Cho Chang é uma bruxa talentosa e graciosamente destaca-se como uma das alunas mais notáveis ​​em Hogwarts. Conhecida por suas tendências e habilidade no quadribol, ela se torna brevemente o interesse romântico de Harry Potter, demonstrando também uma profunda sensibilidade e coragem diante das adversidades. Cho mostra uma força tranquila e uma resiliência admirável, mesmo em meio às dificuldades pessoais, deixando sua marca na trajetória de Harry durante seu tempo em Hogwarts.",
            "imagem": "imagens/Personagens/choChang.png"
        },

        {
            "id": 7,
            "nome": "Cedrico Diggory",
            "casa": "Lufa-Lufa",
            "descricao": "Cedrico Diggory foi um bruxo admirável e destemido em Hogwarts, conhecido por sua integridade e habilidade no quadribol. Ele se destacou como um competidor talentoso e justo no Torneio Tribruxo, demonstrando coragem e nobreza de caráter. Cedrico deixou uma marca indelével como um exemplo de honra e bravura, sendo lembrado por sua generosidade e retidão até nos momentos mais desafiadores.",
            "imagem": "imagens/Personagens/cedrico.png"
        },

        {
            "id": 8,
            "nome": "Ninfadora Tonks",
            "casa": "Lufa-Lufa",
            "descricao": "Ninfadora Tonks é uma bruxa talentosa e alegre, conhecida por sua habilidade metamórfica e espírito cativante em Hogwarts. Ela se destaca como uma Auror Quente, demonstrando determinação e valentia na Ordem da Fênix. Tonks exibe uma personalidade única e um profundo comprometimento com a justiça, deixando sua marca como uma figura crucial na resistência contra as forças das trevas, demonstrando coragem e especialização especial.",
            "imagem": "imagens/Personagens/ninfadoraTonks.png"
        }
    ]
}